# SetTessellationSettings Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
STLExportOptions..::..SetTessellationSettings Method
STLExportOptions Class See Also
---
Sets all the tessellation parameters to its predefined values for the given resolution type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021.1
# Syntax
C#
---
```text
public void SetTessellationSettings(
	ExportResolution resolutionType
)
```

Visual Basic
---
```text
Public Sub SetTessellationSettings ( _
	resolutionType As ExportResolution _
)
```

Visual C++
---
```text
public:
void SetTessellationSettings(
	ExportResolution resolutionType
)
```

# ### Parameters
resolutionType
    Type: Autodesk.Revit.DB..::..ExportResolution Type of exporting resolution.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
STLExportOptions Class
Autodesk.Revit.DB Namespace